// for(var i = 0; i < 10; i++) {
//     console.log(i)
// }

//console.log(i) // ?
// =======================================
// let a = 1;
// let b = { toString() {return '1'} };
// let c = 1;

// console.log(a + b + c)
// ==========================================
// let a = [1,2]
//
// (function() {
//     console.log(a)
// })()
// =========================================
// Сколько параметров можно передать функции ?
// ===========================================
// console.log(str); // ?
// var str = "Hello";
// ===============================================

// console.log([] + 1 + 2)
// =========================================

// Верно ли, что null == undefined?
// =====================================

// a = [1, 2, 3];
// b = [1, 2, 3];
//
// console.log(a == b)
// =======================================
// for(let i=0; i<10; i++) {
//     console.log(i);
// }
//console.log(i) // ?
// =====================================
// 'use strict'
// a = null + undefined;
// console.log(a);
// ==================================
// let y = 1;
// let x = y = 2;
//
// console.log(x);
//  ================================
// "use strict"
// console.log(typeof null)
// ==============================
// let a = (1,5 - 1) * 2;
//
// console.log(a);
// ==============================
//Есть ли разница между выражениями?
// !!( a && b )
// (a && b)
// ======================================
// if (function f(){}) {
//     console.log(typeof f);
// }
// =======================================

// let a = 1.15;
// let b = 2.30;
// console.log(a + b)
// ============================================
// console.log([].push(1,2).unshift(3).join())
// ==================================

